# Creating dataframes

In [1]:
import pandas as pd
import numpy as np

In [3]:
my_series=pd.Series([234,345,654,678,789,459,890,670,456,872])
print(my_series.dtype)

int64

In [5]:
print(my_series.to_list())

[234, 345, 654, 678, 789, 459, 890, 670, 456, 872]

In [6]:
this_df=pd.DataFrame()
print(this_df)

Empty DataFrame
Columns: []
Index: []

### Creating dataframe using list of lists

In [8]:
flowers=[['rose',123],['jasmine',345],['lilly',987],['lotus',546],['marygold',450],['hibiscus',732],['daisy',912],['sunflower',812],['daffodils',120]]
this_df=pd.DataFrame(flowers,columns=['name','number'])
this_df

        name  number
0       rose     123
1    jasmine     345
2      lilly     987
3      lotus     546
4   marygold     450
5   hibiscus     732
6      daisy     912
7  sunflower     812
8  daffodils     120

### Data frame using dictionaries

In [10]:
flowers={'name':['rose','jasmine','lilly','lotus','marygold','hibiscus','daisy','sunflower','daffodils'],
        'number':[123,345,987,546,450,732,912,812,120]}
this_df=pd.DataFrame(flowers)
this_df

        name  number
0       rose     123
1    jasmine     345
2      lilly     987
3      lotus     546
4   marygold     450
5   hibiscus     732
6      daisy     912
7  sunflower     812
8  daffodils     120

### Data frame using list of dictionaries

In [13]:
flowers=[
    {'name':'rose','number':123},
    {'name':'jasmine','number':345},
    {'name':'lilly','number':987},
    {'name':'lotus','number':546},
    {'name':'marygold','number':450},
    {'name':'hibiscus','number':732},
    {'name':'daisy','number':912},
    {'name':'sunflower','number':812},
    {'name':'daffodils','number':120},
]
this_df=pd.DataFrame(flowers)
this_df

        name  number
0       rose     123
1    jasmine     345
2      lilly     987
3      lotus     546
4   marygold     450
5   hibiscus     732
6      daisy     912
7  sunflower     812
8  daffodils     120